def area(a, b):
    """
    Вычисляет площадь прямоугольника со сторонами a и b.

    Принимает:
        a (float): длина первой стороны
        b (float): длина второй стороны

    Возвращает:
        area (float): площадь прямоугольника со сторонами a и b

    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника со сторонами a и b.

    Принимает:
        a (float): длина первой стороны
        b (float): длина второй стороны

    Возвращает:
        perimeter (float): периметр прямоугольника со сторонами a и b

    """
    return (a + b) * 2